KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WB06.svd
        <register>
          <name>COMP_SEL</name>
          <displayName>COMP_SEL</displayName>
          <description>ADC Gain and Offset selection values register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GAIN_OFFSET8</name>
              <description>gain / offset used in ADC differential mode with Vinput range = 3.6V</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GAIN_OFFSET7</name>
              <description>gain / offset used in ADC single positive mode with Vinput range = 3.6V</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GAIN_OFFSET6</name>
              <description>gain / offset used in ADC single negative mode with Vinput range = 3.6V</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GAIN_OFFSET5</name>
              <description>gain / offset used in ADC differential mode with Vinput range = 2.4V</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GAIN_OFFSET4</name>
              <description>gain / offset used in ADC single positive mode with Vinput range = 2.4V</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GAIN_OFFSET3</name>
              <description>gain / offset used in ADC single negative mode with Vinput range = 2.4V</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GAIN_OFFSET2</name>
              <description>gain / offset used in ADC differential mode with Vinput range = 1.2V</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GAIN_OFFSET1</name>
              <description>gain / offset used in ADC single positive mode with Vinput range = 1.2V</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GAIN_OFFSET0</name>
              <description>gain / offset used in ADC single negative mode with Vinput range = 1.2V</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WD_TH</name>
          <displayName>WD_TH</displayName>
          <description>High/low limits for event monitoring a channel register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFF0000</resetValue>
          <fields>
            <field>
              <name>WD_HT</name>
              <description>analog watchdog high level threshold. </description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>WD_LT</name>
              <description>analog watchdog low level threshold. </description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WD_CONF</name>
          <displayName>WD_CONF</displayName>
          <description>Channel selection for event monitoring register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AWD_CHX</name>
              <description>analog watchdog channel selection to define which input channel(s) need to be guarded by the watchdog.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DS_DATAOUT</name>
          <displayName>DS_DATAOUT</displayName>
          <description>Downsampler Data output register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DS_DATA</name>
              <description>contain the converted data at the output of the Down Sampler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DF_DATAOUT</name>
          <displayName>DF_DATAOUT</displayName>
          <description>Decimation filter Data output register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DF_DATA</name>
              <description>contain the converted data at the output of the
								decimation filter.
							</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_STATUS</name>
          <displayName>IRQ_STATUS</displayName>
          <description>Interrupt Status register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DF_OVRFL_IRQ</name>
              <description>set to indicate the decimation filter is saturated. </description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR_DF_IRQ</name>
              <description>set to indicate a decimation filter overrun (a data is lost)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR_DS_IRQ</name>
              <description>set to indicate a Down Sampler overrun (at least one data is lost)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWD_IRQ</name>
              <description>set when an analog watchdog event occurs</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOS_IRQ</name>
              <description>set when a sequence of conversion is completed</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EODF_IRQ</name>
              <description>set when the decimation filter conversion is completed</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EODS_IRQ</name>
              <description>set when the Down Sampler conversion is completed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOC_IRQ</name>
              <description>(Used in test mode only): set when the ADC conversion is completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_ENABLE</name>
          <displayName>IRQ_ENABLE</displayName>
          <description>Enable/disable Interrupts</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DF_OVRFL_IRQ_ENA</name>
              <description>decimation filter saturation interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR_DF_IRQ_ENA</name>
              <description>decimation filter overrun interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR_DS_IRQ_ENA</name>
              <description>Down Sampler overrun interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWD_IRQ_ENA</name>
              <description>analog watchdog interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOS_IRQ_ENA</name>
              <description>End of regular sequence interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EODF_IRQ_ENA</name>
              <description>End of conversion interrupt enable for the decimation filter output</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EODS_IRQ_ENA</name>
              <description>End of conversion interrupt enable for the Down Sampler output</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOC_IRQ_ENA</name>
              <description>(Used in test mode only): End of ADC conversion interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_CONF</name>
          <displayName>TIMER_CONF</displayName>
          <description>Time to add after an LDO Enable or ADC Enable to let the HW to be stable before using it</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00009628</resetValue>
          <fields>
            <field>
              <name>PRECH_DELAY_SEL</name>
              <description>Select the time step PD_STEP for the VBIAS_PRECH_DELAY timer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBIAS_PRECH_DELAY</name>
              <description>define the duration of a waiting time starting at rising edge of PGA_EN signal and corresponding to the VBIAS precharge duration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ADC_LDO_DELAY</name>
              <description>define the duration of a waiting time to be inserted between the ADC_LDO enable and the ADC ON to let time to the LDO to stabilize before starting a conversion.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
