KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WB06.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMAMUX</name>
      <groupName>DMAMUX</groupName>
      <baseAddress>0x48800000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>C0CR</name>
          <displayName>C0CR</displayName>
          <description>CxCR register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>DMAREQ_ID</name>
              <description>DMAREQ_ID[4:0]: DMA REQuest IDentification

Selects the input DMA request. C.f. the DMAMUX table about assignments of multiplexer

inputs to resources.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C1CR</name>
          <displayName>C1CR</displayName>
          <description>CxCR register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>DMAREQ_ID</name>
              <description>DMAREQ_ID[4:0]: DMA REQuest IDentification

Selects the input DMA request. C.f. the DMAMUX table about assignments of multiplexer

inputs to resources.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C2CR</name>
          <displayName>C2CR</displayName>
          <description>CxCR register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>DMAREQ_ID</name>
              <description>DMAREQ_ID[4:0]: DMA REQuest IDentification

Selects the input DMA request. C.f. the DMAMUX table about assignments of multiplexer

inputs to resources.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C3CR</name>
          <displayName>C3CR</displayName>
          <description>CxCR register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>DMAREQ_ID</name>
              <description>DMAREQ_ID[4:0]: DMA REQuest IDentification

Selects the input DMA request. C.f. the DMAMUX table about assignments of multiplexer

inputs to resources.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C4CR</name>
          <displayName>C4CR</displayName>
          <description>CxCR register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>DMAREQ_ID</name>
              <description>DMAREQ_ID[4:0]: DMA REQuest IDentification

Selects the input DMA request. C.f. the DMAMUX table about assignments of multiplexer

inputs to resources.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C5CR</name>
          <displayName>C5CR</displayName>
          <description>CxCR register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>DMAREQ_ID</name>
              <description>DMAREQ_ID[4:0]: DMA REQuest IDentification

Selects the input DMA request. C.f. the DMAMUX table about assignments of multiplexer

inputs to resources.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C6CR</name>
          <displayName>C6CR</displayName>
          <description>CxCR register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>DMAREQ_ID</name>
              <description>DMAREQ_ID[4:0]: DMA REQuest IDentification

Selects the input DMA request. C.f. the DMAMUX table about assignments of multiplexer

inputs to resources.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C7CR</name>
          <displayName>C7CR</displayName>
          <description>CxCR register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>DMAREQ_ID</name>
              <description>DMAREQ_ID[4:0]: DMA REQuest IDentification

Selects the input DMA request. C.f. the DMAMUX table about assignments of multiplexer

inputs to resources.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
