KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WB06.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RADIO_CONTROL</name>
      <groupName>RADIO_CONTROL</groupName>
      <baseAddress>0x60001000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RADIO_CONTROL_ID</name>
          <displayName>RADIO_CONTROL_ID</displayName>
          <description>RADIO_CONTROL_ID register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00003000</resetValue>
          <fields>
            <field>
              <name>REVISION</name>
              <description>Incremented for metal fix version</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VERSION</name>
              <description>Cut Number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRODUCT</name>
              <description>incremented on major features add-on like new Bluetooth LE SIG version support
</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK32COUNT_REG</name>
          <displayName>CLK32COUNT_REG</displayName>
          <description>CLK32COUNT_REG register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000017</resetValue>
          <fields>
            <field>
              <name>SLOW_COUNT</name>
              <description>program the window length (in slow clock period) for slow clock measurement.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK32PERIOD_REG</name>
          <displayName>CLK32PERIOD_REG</displayName>
          <description>CLK32PERIOD_REG register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SLOW_PERIOD</name>
              <description>indicates slow clock period information.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK32FREQUENCY_REG</name>
          <displayName>CLK32FREQUENCY_REG</displayName>
          <description>CLK32FREQUENCY_REG register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SLOW_FREQUENCY</name>
              <description>value equal to (2^39/ SLOW_PERIOD).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RADIO_CONTROL_IRQ_STATUS</name>
          <displayName>RADIO_CONTROL_IRQ_STATUS</displayName>
          <description>RADIO_CONTROL_IRQ_STATUS register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SLOW_CLK_IRQ</name>
              <description>slow clock measurement end of calculation interrupt status
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIO_FSM_IRQ</name>
              <description>Radio FSM interrupt status (aka RfFsm_event_irq).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RADIO_CONTROL_IRQ_ENABLE</name>
          <displayName>RADIO_CONTROL_IRQ_ENABLE</displayName>
          <description>RADIO_CONTROL_IRQ_ENABLE register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SLOW_CLK_IRQ_MASK</name>
              <description>mask slow clock measurement interrupt
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIO_FSM_IRQ_MASK</name>
              <description>mask for each RfFsm_event (Radio FSM) interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RADIO</name>
      <groupName>RADIO</groupName>
      <baseAddress>0x60001500</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x300</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RADIO_ERROR</name>
        <description>RADIO Error interrupt</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>RADIO_CPU_WKUP</name>
        <description>RADIO CPU Wakeup interrupt</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>RADIO_TXRX_WKUP</name>
        <description>RADIO Wakeup interrupt</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>RADIO_TXRX_SEQ</name>
        <description>RADIO RX/TX sequence interrupt</description>
        <value>25</value>
      </interrupt>
      <registers>
        <register>
          <name>AA0_DIG_USR</name>
          <displayName>AA0_DIG_USR</displayName>
          <description>AA0_DIG_USR register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000D6</resetValue>
          <fields>
            <field>
              <name>AA_7_0</name>
              <description>Least significant byte of the Bluetooth LE Access Address code
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AA1_DIG_USR</name>
          <displayName>AA1_DIG_USR</displayName>
          <description>AA1_DIG_USR register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000BE</resetValue>
          <fields>
            <field>
              <name>AA_15_8</name>
              <description>Next byte of the Bluetooth LE Access Address code.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AA2_DIG_USR</name>
          <displayName>AA2_DIG_USR</displayName>
          <description>AA2_DIG_USR register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000089</resetValue>
          <fields>
            <field>
              <name>AA_23_16</name>
              <description>Next byte of the Bluetooth LE Access Address code
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AA3_DIG_USR</name>
          <displayName>AA3_DIG_USR</displayName>
          <description>AA3_DIG_USR register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000008E</resetValue>
          <fields>
            <field>
              <name>AA_31_24</name>
              <description>Most significant byte of the Bluetooth LE Access Address code.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEM_MOD_DIG_USR</name>
          <displayName>DEM_MOD_DIG_USR</displayName>
          <description>DEM_MOD_DIG_USR register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000026</resetValue>
          <fields>
            <field>
              <name>CHANNEL_NUM</name>
              <description>Index for internal lock up table in which the synthesizer setup is contained.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RADIO_FSM_USR</name>
          <displayName>RADIO_FSM_USR</displayName>
          <description>RADIO_FSM_USR register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>EN_CALIB_CBP</name>
              <description>CBP calibration enable bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_CALIB_SYNTH</name>
              <description>SYNTH calibration enable bit.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_POWER</name>
              <description>PA Power coefficient.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHYCTRL_DIG_USR</name>
          <displayName>PHYCTRL_DIG_USR</displayName>
          <description>PHYCTRL_DIG_USR register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXTXPHY</name>
              <description>RXTXPHY selection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AFC1_DIG_ENG</name>
          <displayName>AFC1_DIG_ENG</displayName>
          <description>AFC1_DIG_ENG register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000044</resetValue>
          <fields>
            <field>
              <name>AFC_DELAY_AFTER</name>
              <description>Set the decay factor of the AFC loop after Access Address detection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFC_DELAY_BEFORE</name>
              <description>Set the decay factor of the AFC loop before Access Address detection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR0_DIG_ENG</name>
          <displayName>CR0_DIG_ENG</displayName>
          <description>CR0_DIG_ENG register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000044</resetValue>
          <fields>
            <field>
              <name>CR_GAIN_AFTER</name>
              <description>Set the gain of the clock recovery loop before Access Address detection to the value
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CR_GAIN_BEFORE</name>
              <description>Set the gain of the clock recovery loop before Access Address detection to the value
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR0_LR</name>
          <displayName>CR0_LR</displayName>
          <description>CR0_LR register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000066</resetValue>
          <fields>
            <field>
              <name>CR_LR_GAIN_AFTER</name>
              <description>Set the gain of the clock recovery loop after Access Address detection to the value 2^(-CR_LR_GAIN_ AFTER) when the coded PHY is in use</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CR_LR_GAIN_BEFORE</name>
              <description>Set the gain of the clock recovery loop before Access Address detection to the value 2^(-CR_LR_GAIN_ BEFORE) when the coded PHY is in use</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VIT_CONF_DIG_ENG</name>
          <displayName>VIT_CONF_DIG_ENG</displayName>
          <description>VIT_CONF_DIG_ENG register</description>
          <addressOffset>0x6c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VIT_EN</name>
              <description>Viterbi enable
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPARE</name>
              <description>spare</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LR_PD_THR_DIG_ENG</name>
          <displayName>LR_PD_THR_DIG_ENG</displayName>
          <description>LR_PD_THR_DIG_ENG register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>LR_PD_THR</name>
              <description>preamble detect threshold value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LR_RSSI_THR_DIG_ENG</name>
          <displayName>LR_RSSI_THR_DIG_ENG</displayName>
          <description>LR_RSSI_THR_DIG_ENG register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000001B</resetValue>
          <fields>
            <field>
              <name>LR_RSSI_THR</name>
              <description>RSSI or peak threshold value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LR_AAC_THR_DIG_ENG</name>
          <displayName>LR_AAC_THR_DIG_ENG</displayName>
          <description>LR_AAC_THR_DIG_ENG register</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000038</resetValue>
          <fields>
            <field>
              <name>LR_AAC_THR</name>
              <description>address coded correlation threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNTHCAL0_DIG_ENG</name>
          <displayName>SYNTHCAL0_DIG_ENG</displayName>
          <description>SYNTHCAL0_DIG_ENG register</description>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYNTHCAL_DEBUG_BUS_SEL</name>
              <description>for Debug purpose
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNTH_IF_FREQ_CAL</name>
              <description>Define the frequency applied on the PLL during calibration phase
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DTB5_DIG_ENG</name>
          <displayName>DTB5_DIG_ENG</displayName>
          <description>DTB5_DIG_ENG register</description>
          <addressOffset>0xf0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXTX_START_SEL</name>
              <description>enable the possibility to control some signals by the other register bits instead of system design:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_ACTIVE</name>
              <description>Force TX_ACTIVE signal</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_ACTIVE</name>
              <description>Force RX_ACTIVE signal</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INITIALIZE</name>
              <description>Force INITIALIZE signal (emulate a token request of the IP_BLE)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT_SELECTED_EN</name>
              <description>enable port selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT_SELECTED_0</name>
              <description>force port_selected[0] signal</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXADC_ANA_USR</name>
          <displayName>RXADC_ANA_USR</displayName>
          <description>RXADC_ANA_USR register</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000001B</resetValue>
          <fields>
            <field>
              <name>RFD_RXADC_DELAYTRIM_I</name>
              <description>ADC loop delay control bits for I channel to apply when SW overload is enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFD_RXADC_DELAYTRIM_Q</name>
              <description>ADC loop delay control bits for Q channel to apply when SW overload is enabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXADC_DELAYTRIM_I_TST_SEL</name>
              <description>Enable the SW overload on RXADX delay trimming
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXADC_DELAYTRIM_Q_TST_SEL</name>
              <description>Enable the SW overload on RXADX delay trimming
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDO_ANA_ENG</name>
          <displayName>LDO_ANA_ENG</displayName>
          <description>LDO_ANA_ENG register</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RFD_RF_REG_BYPASS</name>
              <description>RF_REG Bypass mode:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
