KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WB06.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RRM</name>
      <groupName>RRM</groupName>
      <baseAddress>0x60001400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>UDRA_CTRL0</name>
          <displayName>UDRA_CTRL0</displayName>
          <description>UDRA_CTRL0 register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RELOAD_RDCFGPTR</name>
              <description>reload the radio configuration pointer from RAM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UDRA_IRQ_ENABLE</name>
          <displayName>UDRA_IRQ_ENABLE</displayName>
          <description>UDRA_IRQ_ENABLE register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RADIO_CFG_PTR_RELOADED</name>
              <description>UDRA interrupt enable (reload radio config pointer)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_START</name>
              <description>UDRA interrupt enable (command start)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_END</name>
              <description>UDRA interrupt enable (command end)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UDRA_IRQ_STATUS</name>
          <displayName>UDRA_IRQ_STATUS</displayName>
          <description>UDRA_IRQ_STATUS register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RADIO_CFG_PTR_RELOADED</name>
              <description>On read, returns the UDRA reload radio configuration pointer interrupt status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_STARD</name>
              <description>On read, returns the UDRA command start interrupt status.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_END</name>
              <description>On read, returns the UDRA command end interrupt status
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UDRA_RADIO_CFG_PTR</name>
          <displayName>UDRA_RADIO_CFG_PTR</displayName>
          <description>UDRA_RADIO_CFG_PTR register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RADIO_CONFIG_ADDRESS</name>
              <description>UDRA radio configuration address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEMA_IRQ_ENABLE</name>
          <displayName>SEMA_IRQ_ENABLE</displayName>
          <description>SEMA_IRQ_ENABLE register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LOCK</name>
              <description>semaphore locked (= one port granted) interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCK</name>
              <description>semaphore unlocked (=no port selected) interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEMA_IRQ_STATUS</name>
          <displayName>SEMA_IRQ_STATUS</displayName>
          <description>SEMA_IRQ_STATUS register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LOCK</name>
              <description>On read, returns the semaphore locked interrupt status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCK</name>
              <description>On read, returns the semaphore unlocked interrupt status.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_IRQ_ENABLE</name>
          <displayName>BLE_IRQ_ENABLE</displayName>
          <description>BLE_IRQ_ENABLE register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PORT_GRANT</name>
              <description>IP_BLE Port grant interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT_RELEASE</name>
              <description>IP_BLE Port release interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT_CMD_START</name>
              <description>IP_BLE Port command start interrup enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT_CMD_END</name>
              <description>IP_BLE Port command end interrup enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_IRQ_STATUS</name>
          <displayName>BLE_IRQ_STATUS</displayName>
          <description>BLE_IRQ_STATUS register</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PORT_GRANT</name>
              <description>IP_BLE hardware port granted interrupt status:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT_RELEASE</name>
              <description>IP_BLE hardware port released interrupt status.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_START</name>
              <description>IP_BLE hardware port command start interrupt status.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_END</name>
              <description>IP_BLE hardware port command end interrupt status.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VP_CPU_CMD_BUS</name>
          <displayName>VP_CPU_CMD_BUS</displayName>
          <description>VP_CPU_CMD_BUS register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COMMAND</name>
              <description>command number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND_REQ</name>
              <description>CPU Virtual port command request:
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VP_CPU_SEMA_BUS</name>
          <displayName>VP_CPU_SEMA_BUS</displayName>
          <description>VP_CPU_SEMA_BUS register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TAKE_PRIO</name>
              <description>semaphore priority: priority value (between 0 and 7) of the take request.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TAKE_REQ</name>
              <description>semaphore token request:
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VP_CPU_IRQ_ENABLE</name>
          <displayName>VP_CPU_IRQ_ENABLE</displayName>
          <description>VP_CPU_IRQ_ENABLE register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PORT_GRANT</name>
              <description>CPU virtual port grant interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT_RELEASE</name>
              <description>CPU virtual port release interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT_CMD_START</name>
              <description>CPU virtual port command start interrup enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT_CMD_END</name>
              <description>CPU virtual port command end interrup enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VP_CPU_IRQ_STATUS</name>
          <displayName>VP_CPU_IRQ_STATUS</displayName>
          <description>VP_CPU_IRQ_STATUS register</description>
          <addressOffset>0x6c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PORT_GRANT</name>
              <description>CPU virtual port granted interrupt status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT_RELEASE</name>
              <description>virtual port released interrupt status.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT_PREEMPT</name>
              <description>CPU virtual port preemption (at semaphore level) interrupt status.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_START</name>
              <description>CPU virtual port command start interrupt status.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_END</name>
              <description>CPU virtual port command end interrupt status.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
