KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WB06.svd
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>ISR register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000000C0</resetValue>
          <fields>
            <field>
              <name>PE</name>
              <description>PE: Parity error
This bit is set by hardware when a parity error occurs in receiver mode. It is cleared by
software, writing 1 to the PECF in the USART_ICR register. 
An interrupt is generated if PEIE = 1 in the USART_CR1 register.
-0: No parity error
-1: Parity error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FE</name>
              <description>FE: Framing error
This bit is set by hardware when a de-synchronization, excessive noise or a break character
is detected. It is cleared by software, writing 1 to the FECF bit in the USART_ICR register.
In Smartcard mode, in transmission, this bit is set when the maximum number of transmit
attempts is reached without success (the card NACKs the data frame).
An interrupt is generated if EIE = 1 in the USART_CR1 register.
-0: No Framing error is detected
-1: Framing error or break character is detected</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NF</name>
              <description>NF: START bit Noise detection flag
This bit is set by hardware when noise is detected on a received frame. It is cleared by
software, writing 1 to the NFCF bit in the USART_ICR register.
-0: No noise is detected
-1: Noise is detected</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ORE</name>
              <description>ORE: Overrun error
This bit is set by hardware when the data currently being received in the shift register is
ready to be transferred into the USARTx_RDR register while RXNE=1 (RXFF = 1 in case
FIFO mode is enabled) . It is cleared by a software, writing 1 to the ORECF, in the
USARTx_ICR register.
An interrupt is generated if RXNEIE/ RXFNEIE=1 or EIE = 1 in the USARTx_CR1 register.
-0: No overrun error
-1: Overrun error is detected</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE</name>
              <description>IDLE: Idle line detected
This bit is set by hardware when an Idle Line is detected. An interrupt is generated if
IDLEIE=1 in the USART_CR1 register. It is cleared by software, writing 1 to the IDLECF in
the USART_ICR register.
-0: No Idle line is detected
-1: Idle line is detected</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXNE_RXFNE</name>
              <description>RXNE/RXFNE:Read data register not empty/RXFIFO not empty
RXNE bit is set by hardware when the content of the USARTx_RDR shift register has been
transferred
to the USARTx_RDR register. It is cleared by a read to the USARTx_RDR register. The
RXNE flag can also be cleared by writing 1 to the RXFRQ in the USARTx_RQR register.
RXFNE bit is set by hardware when the RXFIFO is not empty, and so data can be read from
the USART_RDR register. Every read of the USART_RDR frees a location in the RXFIFO. It
is cleared when the RXFIFO is empty.
The RXNE/RXFNE flag can also be cleared by writing 1 to the RXFRQ in the USART_RQR
register.
An interrupt is generated if RXNEIE/RXFNEIE=1 in the USART_CR1 register.
-0: Data is not received
-1: Received data is ready to be read.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TC</name>
              <description>TC: Transmission complete
This bit indicates when the last data written in the USART_TDR has been transmitted out of
the shift register.
It is set by hardware if the transmission of a frame containing data is complete and if
TXE/TXFE is set. An interrupt is generated if TCIE=1 in the USART_CR1 register. It is
cleared by software, writing 1 to the TCCF in the USART_ICR register or by a write to the
USART_TDR register.
An interrupt is generated if TCIE=1 in the USART_CR1 register.
-0: Transmission is not complete
-1: Transmission is complete</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXE_TXFNF</name>
              <description>TXE/TXFNF: Transmit data register empty/TXFIFO not full
When FIFO mode is disabled, TXE is set by hardware when the content of the
USARTx_TDR register has been transferred into the shift register. It is cleared by a write to
the USARTx_TDR register. The TXE flag can also be set by writing 1 to the TXFRQ in the
USART_RQR register, in order to discard the data (only in Smartcard T=0 mode, in case of
transmission failure).
When FIFO mode is enabled, TXFNF is set by hardware when TXFIFO is not full, and so
data can be written in the USART_TDR. Every write in the USART_TDR places the data in
the TXFIFO. This flag remains set until the TXFIFO is full. When the TXFIFO is full, this flag
is cleared indicating that data can not be written into the USART_TDR.
Note: The TXFNF is kept reset during the flush request until TXFIFO is empty . After
sending the flush request (by setting TXFRQ bit), the flag TXFNF should be checked prior to
writing in TXFIFO. (TXFNF and TXFE will be set at the same time).
An interrupt is generated if the TXEIE/TXFNFIE bit =1 in the USART_CR1 register.
-0: Data register is full/Transmit FIFO is full.
-1: Data register/Transmit FIFO is not full</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CTSIF</name>
              <description>CTSIF: CTS interrupt flag
This bit is set by hardware when the nCTS input toggles, if the CTSE bit is set. It is cleared
by software, by writing 1 to the CTSCF bit in the USART_ICR register.
An interrupt is generated if CTSIE=1 in the USART_CR3 register.
-0: No change occurred on the nCTS status line
-1: A change occurred on the nCTS status line</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CTS</name>
              <description>CTS: CTS flag
This bit is set/reset by hardware. It is an inverted copy of the status of the nCTS input pin.
-0: nCTS line set
-1: nCTS line reset</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>BUSY: Busy flag
This bit is set and reset by hardware. It is active when a communication is ongoing on the
RX line (successful start bit detected). It is reset at the end of the reception (successful or
not).
-0: USART is idle (no reception)
-1: Reception on going</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMF</name>
              <description>CMF: Character match flag
This bit is set by hardware, when a the character defined by ADD[7:0] is received. It is
cleared by software, writing 1 to the CMCF in the USART_ICR register.
An interrupt is generated if CMIE=1in the USART_CR1 register.
-0: No Character match detected
-1: Character Match detected</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SBKF</name>
              <description>SBKF: Send break flag
This bit indicates that a send break character was requested. It is set by software, by writing
1 to the SBKRQ bit in the USART_CR3 register. It is automatically reset by hardware during
the stop bit of break transmission.
-0: No break character is transmitted
-1: Break character will be transmitted</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RWU</name>
              <description>RWU: Receiver wakeup from Mute mode
This bit indicates if the USART is in mute mode. It is cleared/set by hardware when a
wakeup/mute sequence is recognized. The mute mode control sequence (address or IDLE)
is selected by the WAKE bit in the USART_CR1 register.
When wakeup on IDLE mode is selected, this bit can only be set by software, writing 1 to the
MMRQ bit in the USART_RQR register.
-0: Receiver in active mode
-1: Receiver in mute mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TEACK</name>
              <description>TEACK: Transmit enable acknowledge flag
This bit is set/reset by hardware, when the Transmit Enable value is taken into account by
the USART.
It can be used when an idle frame request is generated by writing TE=0, followed by TE=1
in the USART_CR1 register, in order to respect the TE=0 minimum period.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REACK</name>
              <description>REACK: Receive enable acknowledge flag
This bit is set/reset by hardware, when the Receive Enable value is taken into account by
the USART.
It can be used to verify that the USART is ready for reception before entering Stop mode.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFE</name>
              <description>TXFE: TXFIFO Empty
This bit is set by hardware when TXFIFO is Empty. When the TXFIFO contains at least one
data, this flag is cleared. The TXFE flag can also be set by writing 1 to the bit TXFRQ (bit 4) in
the USART_RQR register.
An interrupt is generated if the TXFEIE bit =1 (bit 30) in the USART_CR1 register.
-0: TXFIFO is not empty.
-1: TXFIFO is empty.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFF</name>
              <description>RXFF: RXFIFO Full
This bit is set by hardware when RXFIFO is Full.
An interrupt is generated if the RXFFIE bit =1 in the USART_CR1 register.
-0: RXFIFO is not Full.
-1: RXFIFO is Full.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFT</name>
              <description>RXFT: RXFIFO threshold flag
This bit is set by hardware when the programmed threshold in RXFTCFG in USARTx_CR3
register is reached. This means that there are (RXFTCFG - 1) data in the Receive FIFO and
one data in the USART_RDR register. An interrupt is generated if the RXFTIE bit =1 (bit 27) in
the USART_CR3 register.
-0: Receive FIFO doesnt reach the programmed threshold.
-1: Receive FIFO reached the programmed threshold</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFT</name>
              <description>TXFT: TXFIFO threshold flag
This bit is set by hardware when the TXFIFO reaches the programmed threshold in TXFTCFG
in USARTx_CR3 register i.e. the TXFIFO contains TXFTCFG empty locations. An interrupt is
generated if the TXFTIE bit =1 (bit 31) in the USART_CR3 register.
-0: TXFIFO doesnt reach the programmed threshold.
-1: TXFIFO reached the programmed threshold</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <displayName>ICR</displayName>
          <description>ICR register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PECF</name>
              <description>PECF: Parity error clear flag
Writing 1 to this bit clears the PE flag in the USART_ISR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FECF</name>
              <description>FECF: Framing error clear flag
Writing 1 to this bit clears the FE flag in the USART_ISR register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NECF</name>
              <description>NECF: Noise detected clear flag
Writing 1 to this bit clears the NF flag in the USART_ISR register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ORECF</name>
              <description>ORECF: Overrun error clear flag
Writing 1 to this bit clears the ORE flag in the USART_ISR register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IDLECF</name>
              <description>IDLECF: Idle line detected clear flag
Writing 1 to this bit clears the IDLE flag in the USART_ISR register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TCCF</name>
              <description>TCCF: Transmission complete clear flag
Writing 1 to this bit clears the TC flag in the USART_ISR register</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTSCF</name>
              <description>CTSCF: CTS clear flag
Writing 1 to this bit clears the CTSIF flag in the USART_ISR register</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CMCF</name>
              <description>CMCF: Character match clear flag
Writing 1 to this bit clears the CMF flag in the USART_ISR register</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WUCF</name>
              <description>WUCF: Wakeup from Stop mode clear flag
Writing 1 to this bit clears the WUF flag in the LPUART_ISR register</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDR</name>
          <displayName>RDR</displayName>
          <description>RDR register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>RDR</name>
              <description>RDR[8:0]: Receive data value
Contains the received data character.
The RDR register provides the parallel interface between the input shift register and the
internal bus (see Figure 124).
When receiving with the parity enabled, the value read in the MSB bit is the received parity
bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TDR</name>
          <displayName>TDR</displayName>
          <description>TDR register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>TDR</name>
              <description>TDR[8:0]: Transmit data value
Contains the data character to be transmitted.
The USARTx_TDR register provides the parallel interface between the internal bus and the
output shift register (see Figure 124).
When transmitting with the parity enabled (PCE bit set to 1 in the USART_CR1 register),
the value written in the MSB (bit 7 or bit 8 depending on the data length) has no effect
because it is replaced by the parity.
Note: This register must be written only when TXE/TXFNF=1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESC</name>
          <displayName>PRESC</displayName>
          <description>PRESC register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRESCALER</name>
              <description>PRESCALER[3:0]: Clock prescaler
The USART input clock can be divided by a prescaler:
-0000: input clock not divided
-0001: input clock divided by 2
-0010: input clock divided by 4
-0011: input clock divided by 6
-0100: input clock divided by 8
-0101: input clock divided by 10
-0110: input clock divided by 12
-0111: input clock divided by 16
-1000: input clock divided by 32
-1001: input clock divided by 64
-1010: input clock divided by 128
-1011: input clock divided by 256
Remaing combinations: Reserved.
Note: When PRESCALER is programmed with a value different of the allowed ones,
programmed prescaler value will be 1011 i.e. input clock divided by 256</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
