KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WB06.svd
        <register>
          <name>IO_IER</name>
          <displayName>IO_IER</displayName>
          <description>IO_IER register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000000</resetValue>
          <fields>
            <field>
              <name>PA0_IE</name>
              <description>PA0_IE: Interrupt enable for port A I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    0: interrupt is disabled.
 1: interrupt is enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA1_IE</name>
              <description>PA1_IE: Interrupt enable for port A I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    0: interrupt is disabled.
 1: interrupt is enabled.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA2_IE</name>
              <description>PA2_IE: Interrupt enable for port A I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    0: interrupt is disabled.
 1: interrupt is enabled.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA3_IE</name>
              <description>PA3_IE: Interrupt enable for port A I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    0: interrupt is disabled.
 1: interrupt is enabled.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA4_IE</name>
              <description>PA4_IE: Interrupt enable for port A I/Os.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA5_IE</name>
              <description>PA5_IE: Interrupt enable for port A I/Os.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA6_IE</name>
              <description>PA6_IE: Interrupt enable for port A I/Os.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA7_IE</name>
              <description>PA7_IE: Interrupt enable for port A I/Os.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA8_IE</name>
              <description>PA8_IE: Interrupt enable for port A I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    0: interrupt is disabled.
 1: interrupt is enabled.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA9_IE</name>
              <description>PA9_IE: Interrupt enable for port A I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    0: interrupt is disabled.
 1: interrupt is enabled.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA10_IE</name>
              <description>PA10_IE: Interrupt enable for port A I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    0: interrupt is disabled.
 1: interrupt is enabled.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA11_IE</name>
              <description>PA11_IE: Interrupt enable for port A I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    0: interrupt is disabled.
 1: interrupt is enabled.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA12_IE</name>
              <description>PA12_IE: Interrupt enable for port A I/Os.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA13_IE</name>
              <description>PA13_IE: Interrupt enable for port A I/Os.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA14_IE</name>
              <description>PA14_IE: Interrupt enable for port A I/Os.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA15_IE</name>
              <description>PA15_IE: Interrupt enable for port A I/Os.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB0_IE</name>
              <description>PB0_IE: Interrupt enable for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    0: interrupt is disabled.
 1: interrupt is enabled.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB1_IE</name>
              <description>PB1_IE: Interrupt enable for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    0: interrupt is disabled.
 1: interrupt is enabled.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB2_IE</name>
              <description>PB2_IE: Interrupt enable for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    0: interrupt is disabled.
 1: interrupt is enabled.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB3_IE</name>
              <description>PB3_IE: Interrupt enable for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    0: interrupt is disabled.
 1: interrupt is enabled.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB4_IE</name>
              <description>PB4_IE: Interrupt enable for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    0: interrupt is disabled.
 1: interrupt is enabled.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB5_IE</name>
              <description>PB5_IE: Interrupt enable for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    0: interrupt is disabled.
 1: interrupt is enabled.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB6_IE</name>
              <description>PB6_IE: Interrupt enable for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    0: interrupt is disabled.
 1: interrupt is enabled.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB7_IE</name>
              <description>PB7_IE: Interrupt enable for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    0: interrupt is disabled.
 1: interrupt is enabled.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB8_IE</name>
              <description>PB8_IE: Interrupt enable for port B I/Os.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB9_IE</name>
              <description>PB9_IE: Interrupt enable for port B I/Os.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB10_IE</name>
              <description>PB10_IE: Interrupt enable for port B I/Os.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB11_IE</name>
              <description>PB11_IE: Interrupt enable for port B I/Os.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB12_IE</name>
              <description>PB12_IE: Interrupt enable for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    0: interrupt is disabled.
 1: interrupt is enabled.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB13_IE</name>
              <description>PB13_IE: Interrupt enable for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    0: interrupt is disabled.
 1: interrupt is enabled.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB14_IE</name>
