KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WB06.svd
              <description>PB14_IE: Interrupt enable for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    0: interrupt is disabled.
 1: interrupt is enabled.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB15_IE</name>
              <description>PB15_IE: Interrupt enable for port B I/Os.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    0: interrupt is disabled.
 1: interrupt is enabled.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_ISCR</name>
          <displayName>IO_ISCR</displayName>
          <description>IO_ISCR register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PA0_ISC</name>
              <description>PA0_ISC: Interrupt status (before mask) for port a I/Os.
 0: no pending interrupt.
 1: event occurred on corresponding I/O / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA1_ISC</name>
              <description>PA1_ISC: Interrupt status (before mask) for port a I/Os.
 0: no pending interrupt.
 1: event occurred on corresponding I/O / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA2_ISC</name>
              <description>PA2_ISC: Interrupt status (before mask) for port a I/Os.
 0: no pending interrupt.
 1: event occurred on corresponding I/O / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA3_ISC</name>
              <description>PA3_ISC: Interrupt status (before mask) for port a I/Os.
 0: no pending interrupt.
 1: event occurred on corresponding I/O / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA4_ISC</name>
              <description>PA4_ISC: Interrupt status (before mask) for port a I/Os..</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA5_ISC</name>
              <description>PA5_ISC: Interrupt status (before mask) for port a I/Os..</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA6_ISC</name>
              <description>PA6_ISC: Interrupt status (before mask) for port a I/Os..</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA7_ISC</name>
              <description>PA7_ISC: Interrupt status (before mask) for port a I/Os..</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA8_ISC</name>
              <description>PA8_ISC: Interrupt status (before mask) for port a I/Os.
 0: no pending interrupt.
 1: event occurred on corresponding I/O / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA9_ISC</name>
              <description>PA9_ISC: Interrupt status (before mask) for port a I/Os.
 0: no pending interrupt.
 1: event occurred on corresponding I/O / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA10_ISC</name>
              <description>PA10_ISC: Interrupt status (before mask) for port a I/Os.
 0: no pending interrupt.
 1: event occurred on corresponding I/O / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA11_ISC</name>
              <description>PA11_ISC: Interrupt status (before mask) for port a I/Os.
 0: no pending interrupt.
 1: event occurred on corresponding I/O / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA12_ISC</name>
              <description>PA12_ISC: Interrupt status (before mask) for port a I/Os.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA13_ISC</name>
              <description>PA13_ISC: Interrupt status (before mask) for port a I/Os.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA14_ISC</name>
              <description>PA14_ISC: Interrupt status (before mask) for port a I/Os.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA15_ISC</name>
              <description>PA15_ISC: Interrupt status (before mask) for port a I/Os.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB0_ISC</name>
              <description>PB0_ISC: Interrupt status (before mask) for port B I/Os.
 0: no pending interrupt.
 1: event occurred on corresponding I/O / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB1_ISC</name>
              <description>PB1_ISC: Interrupt status (before mask) for port B I/Os.
 0: no pending interrupt.
 1: event occurred on corresponding I/O / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB2_ISC</name>
              <description>PB2_ISC: Interrupt status (before mask) for port B I/Os.
 0: no pending interrupt.
 1: event occurred on corresponding I/O / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB3_ISC</name>
              <description>PB3_ISC: Interrupt status (before mask) for port B I/Os.
 0: no pending interrupt.
 1: event occurred on corresponding I/O / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB4_ISC</name>
              <description>PB4_ISC: Interrupt status (before mask) for port B I/Os.
 0: no pending interrupt.
 1: event occurred on corresponding I/O / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB5_ISC</name>
              <description>PB5_ISC: Interrupt status (before mask) for port B I/Os.
 0: no pending interrupt.
 1: event occurred on corresponding I/O / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB6_ISC</name>
              <description>PB6_ISC: Interrupt status (before mask) for port B I/Os.
 0: no pending interrupt.
 1: event occurred on corresponding I/O / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB7_ISC</name>
              <description>PB7_ISC: Interrupt status (before mask) for port B I/Os.
 0: no pending interrupt.
 1: event occurred on corresponding I/O / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB8_ISC</name>
              <description>PB8_ISC: Interrupt status (before mask) for port B I/Os..</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB9_ISC</name>
              <description>PB9_ISC: Interrupt status (before mask) for port B I/Os..</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB10_ISC</name>
              <description>PB10_ISC: Interrupt status (before mask) for port B I/Os..</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB11_ISC</name>
              <description>PB11_ISC: Interrupt status (before mask) for port B I/Os..</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB12_ISC</name>
              <description>PB12_ISC: Interrupt status (before mask) for port B I/Os.
 0: no pending interrupt.
 1: event occurred on corresponding I/O / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB13_ISC</name>
              <description>PB13_ISC: Interrupt status (before mask) for port B I/Os.
 0: no pending interrupt.
 1: event occurred on corresponding I/O / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB14_ISC</name>
              <description>PB14_ISC: Interrupt status (before mask) for port B I/Os.
 0: no pending interrupt.
 1: event occurred on corresponding I/O / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB15_ISC</name>
              <description>PB15_ISC: Interrupt status (before mask) for port B I/Os.
 0: no pending interrupt.
 1: event occurred on corresponding I/O / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRC_IER</name>
          <displayName>PWRC_IER</displayName>
          <description>PWRC_IER register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000000</resetValue>
          <fields>
            <field>
              <name>PVD_IE</name>
              <description>PVD_IE: Programmable Voltage Detector interrupt enable.
 0: PVD interrupt is disabled.
 1: PVD interrupt is enabled.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUP_IE</name>
              <description>WKUP_IE: Power Controller Wakeup event interrupt enable.
 0: Interrupt on wakeup event seen by the PWRC is disabled.
 1: Interrupt on wakeup event seen by the PWRC is enabled.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRC_ISCR</name>
          <displayName>PWRC_ISCR</displayName>
          <description>PWRC_ISCR register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000000</resetValue>
          <fields>
            <field>
              <name>PVD_ISC</name>
              <description>PVD_ISC: Programmable Voltage Detector status.
 0: no pending interrupt.
 1: voltage went under programmed threshold / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUP_ISC</name>
              <description>WKUP_ISC: Indicates the Power Controller receives a Wakeup event.
 0: no pending interrupt.
 1: Wakeup event on PWRC occurred / interrupt occurred (if enabled).
Cleared by writing 1 in the bit.
This flag will be read at 1 if a wakeup event arrives so close to the low power mode entry
requests that the PWRC aborts before shutting down the system.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLERXTX_DTR</name>
          <displayName>BLERXTX_DTR</displayName>
          <description>BLERXTX_DTR register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000000</resetValue>
          <fields>
            <field>
              <name>TX_DT</name>
              <description>TX_DT: detection type on TX_SEQUENCE signal:
 0: detection on edge (default).
 1: detection on level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_DT</name>
              <description>RX_DT: detection type on RX_SEQUENCE signal:
 0: detection on edge (default).
 1: detection on level</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLERXTX_IBER</name>
          <displayName>BLERXTX_IBER</displayName>
          <description>BLERXTX_IBER register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000000</resetValue>
          <fields>
            <field>
              <name>TX_IBE</name>
              <description>TX_IBE: interrupt edge register on TX_SEQUENCE signal:
 0: detection on single edge (default).
 1: detection on both edges</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_IBE</name>
              <description>RX_IBE: interrupt edge register on RX_SEQUENCE signal:
 0: detection on single edge (default).
 1: detection on both edges</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLERXTX_IEVR</name>
          <displayName>BLERXTX_IEVR</displayName>
          <description>BLERXTX_IEVR register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000000</resetValue>
          <fields>
            <field>
              <name>TX_IEV</name>
              <description>TX_IEV: interrupt polarity event on TX_SEQUENCE signal:
 0: detection on falling edge / low level (default).
 1: detection on rising edge / high level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_IEV</name>
              <description>RX_IEV: interrupt polarity event on RX_SEQUENCE signal:
 0: detection on falling edge / low level (default).
 1: detection on rising edge / high level</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLERXTX_IER</name>
          <displayName>BLERXTX_IER</displayName>
          <description>BLERXTX_IER register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000000</resetValue>
          <fields>
            <field>
              <name>TX_IE</name>
              <description>TX_IE: interrupt enable on TX_SEQUENCE signal:
 0: TX_SEQUENCE interrupt is disabled (default).
 1: TX_SEQUENCE interrupt is enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_IE</name>
              <description>RX_IE: interrupt enable on RX_SEQUENCE signal:
 0: RX_SEQUENCE interrupt is disabled (default).
 1: RX_SEQUENCE interrupt is enabled</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLERXTX_ISCR</name>
          <displayName>BLERXTX_ISCR</displayName>
          <description>BLERXTX_ISCR register</description>
          <addressOffset>0x3C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x000000000</resetValue>
          <fields>
            <field>
              <name>TX_ISC</name>
              <description>TX_ISC:interrupt status on TX_SEQUENCE signal (can be a rising or a falling edge
depending on BLERXTX_IEVR and BLERXTX_IBER):
 0: no activity on TX_SEQUENCE detected.
 1: activity on TX_SEQUENCE occurred</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_ISC</name>
              <description>RX_ISC: interrupt status on RX_SEQUENCE signal (can be a rising or a falling edge
depending on BLERXTX_IEVR and BLERXTX_IBER):
 0: no activity on RX_SEQUENCE detected.
 1: activity on RX_SEQUENCE occurred</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
